Repository: wolfsilver/ehForwarderBot
Catalog: ehforwarderbot/locale/*/LC_MESSAGES/ehforwarderbot.po
Languages: es_ve, tr_tr

source: Python 3.6 or higher is required. Your version is {version}.
es_ve: Se requiere Python 3.6 o superior. Tu versión es {version}.
tr_tr: Python 3.6 veya daha üstü gerekmektedir. Sizin sürümünüz {version}.

source: EH Forwarder Bot is an extensible chat tunnel framework which allows users to contact people from other chat platforms, and ultimately remotely control their accounts in other platforms.
es_ve: EH Forwarder Bot es un framework de túnel de chat extensible que permite a los usuarios contactar a personas de otras plataformas de chat y, finalmente, controlar sus cuentas de forma remota en otras plataformas.
tr_tr: EH Forwarder Bot, kullanıcıların öteki sohbet platformlarındaki insanlar ile iletişim kurabilmelerini sağlayan, ve diğer platformlardaki hesaplarını uzaktan kontrol etmelerini sağlayan, genişletilebilir bir sohbet tüneli altyapısıdır.

source: Enable verbose mode. (Level: Debug)
es_ve: Habilite el modo detallado. (Nivel: Depurar)
tr_tr: Ayrıntılı modu etkinleştir. (Düzey: Hata Ayıklama)

source: Show version numbers and exit.
es_ve: Mostrar números de versión y salir.
tr_tr: Sürüm numaralarını göster ve çıkış yap.

source: Choose a profile to start with.
es_ve: Elija un perfil para comenzar.
tr_tr: Başlamak için bir profil seç.

source: Initializing slave {}...
es_ve: Inicializando el esclavo {}...
tr_tr: Bağımlı birim başlatılıyor {}...

source: Slave channel {name} ({id}) # {instance_id} is initialized.
es_ve: El canal esclavo {name} ({id}) # {instance_id} se inicializa.
tr_tr: Bağımlı kanal {name} ({id}) # {instance_id} başlatıldı.

source: Default profile
es_ve: Perfil por defecto
tr_tr: Varsayılan profil

source: Initializing master {}...
es_ve: Inicializando el maestro {}...
tr_tr: Ana birim başlatılıyor {}...

source: Master channel {name} ({id}) # {instance_id} is initialized.
es_ve: El canal maestro {name} ({id}) # {instance_id} está inicializado.
tr_tr: Ana kanal {name} ({id}) # {instance_id} başlatıldı.

source: All channels initialized.
es_ve: Todos los canales inicializados.
tr_tr: Tüm kanallar başlatıldı.

source: Initializing middleware {}...
es_ve: Inicializando middleware {}...
tr_tr: Aracı yazılım başlatılıyor {}...

source: Middleware {name} ({id}) # {instance_id} is initialized.
es_ve: El middleware {name} ({id}) # {instance_id} está inicializado.
tr_tr: Middleware {name} ({id}) # {instance_id} başlatıldı.

source: All middlewares are initialized.
es_ve: Todos los middlewares están inicializados.
tr_tr: Tüm aracı yazılımlar başlatıldı.

source: EH Forwarder Bot Version: {version} Python version: {py_version}
es_ve: EH Forwarder Bot Versión: {version} Versión de Python: {py_version}
tr_tr: EH Forwarder Bot Versiyonu: {version} Python versiyonu: {py_version}

source: Master channel:
es_ve: Canal maestro:
tr_tr: Ana kanal:

source: Slave channel:
es_ve: Canal esclavo:
tr_tr: Bağımlı kanal:

source: Middleware:
tr_tr: Aracı yazılım:

source: No middleware is enabled.
es_ve: No hay middleware habilitado.
tr_tr: Hiçbir aracı yazılım aktif değil.
