Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/master.po
Languages: es_ve, zh_cn

source: Master channels
es_ve: Canales principales
zh_cn: 主端

source: Master channels are the interface that directly or indirectly interact with the user. Despite the first master channel of EFB (EFB Telegram Master) is written in a form of Telegram Bot, master channels can be written in many forms, such as:
es_ve: Los canales principales son la interfaces que interactúa directa o indirectamente con el usuario. A pesar del primer canal maestro de EFB (EFB telegrama maestro) está escrito en una forma de bot telegrama, los canales principales se pueden escribir en muchas formas, tales como:
zh_cn: 主端是 EFB 框架直接或间接与用户交互的界面。尽管 EFB 的第一个主端（EFB Telegram 主端）是用 Telegram Bot 的形式展现的，但主端的展现形式可能多重多样：

source: A web app
es_ve: Una aplicación Web
zh_cn: Web App

source: A server that expose APIs to dedicated desktop and mobile clients
es_ve: Un servidor que expone APIs a clientes de escritorio y móviles dedicados
zh_cn: 提供 API 给专有桌面和移动客户端程序的服务端程序

source: A chat bot on an existing IM
es_ve: Un bot chat en un IM existente
zh_cn: 面向现有 IM 的 bot

source: A server that compiles with a generic IM Protocol
es_ve: Un servidor que compila con un protocolo im genérico
zh_cn: 使用泛用型 IM 协议的服务器程序

source: A CLI client
es_ve: Un cliente CLI
zh_cn: CLI 客户端

source: Anything else you can think of...
es_ve: Cualquier otra cosa que puedas pensar...
zh_cn: 其他任何你能想到的形式...

source: Design guideline
es_ve: Lineamientos de diseño
zh_cn: 设计指南

source: When the master channel is implemented on an existing protocol or platform, as far as possible, while considering the user experience, a master channel SHOULD:
zh_cn: 当主端在现有的协议或平台上实现时，在尽可能在考虑用户体验的同时也应当（SHOULD）：

source: maintain one conversation thread per chat, indicating its name, source channel and type;
zh_cn: 为每一个会话提供一个专属的聊天串，标注其名称、来源信道和类型；

source: support all, if not most, types of messages defined in the framework, process and deliver messages between the user and slave channels;
es_ve: soportar todos, o al menos la mayoría de los tipos de mensajes definidos en el framework, procesar y entregar los mensajes entre el usuario y los canales esclavos;
zh_cn: 尽可能支持框架所定义的所有消息类型，在用户和从端之间处理并传递消息；

source: support all, if not most, features of messages, including: targeted message reply, chat substitution in text (usually used in @ references), commands, etc. Master channel SHOULD be able to process incoming messages with such features, and send messages with such features to slave channels if applicable;
zh_cn: 尽可能支持所有消息特性，包括直接回复消息、消息指向替换（通常用于 @ 引用用户）、消息指令等。主端应当（SHOULD）能够处理来自从端的具有此类特性的消息，并在适当的情况允许用户发送具有这些特性的消息到从端；

source: be able to invoke and process "additional features" offered by slave channels.
es_ve: ser capaz de invocar y procesar "características adicionales" ofrecidas por los canales esclavos.
zh_cn: 能够调用和处理从端提供的「附加功能」。

source: Optionally, a master channel can also support / identify vendor-specified information from certain slave channels.
es_ve: Opcionalmente, un canal maestro puede soportar/identificar información específica del proveedor de algunos canales esclavos.
zh_cn: 另外，主端可以选择支持一些从端提供的「供应商特定」数据。

source: An example of an ideal design of a master channel, inspired by Telegram Desktop
es_ve: Ejemplo del diseño ideal de una canal maestro, inspirado por la aplicación de escritorio de Telegram
zh_cn: 理想的主端设计的例子，灵感来自 Telegram Desktop

source: Depends on your implementation, a master channel may probably needs to maintain a list of chats and messages, for presentation or other purposes.
es_ve: Dependiendo de la implementación, un canal maestro probablemente necesite mantener una lista de chats y mensajes para presentación u otros propósitos.
zh_cn: 取决于实现方式，主端可能需要维护一个完整的会话和消息列表，以展示给用户或用作其他用途。

source: Message delivery
es_ve: Entrega de mensajes
zh_cn: 消息传递

source: Implementation details
zh_cn: 实现细节

source: See :class:`.MasterChannel`.
zh_cn: 参见 \ :class:`.MasterChannel`。
