Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/middleware.po
Languages: id_id, zh_cn

source: Middlewares
zh_cn: 中间件

source: Middlewares works in between the master channel and slave channels, they look through messages and statuses delivered between channels, passing them on, make changes or discarding them, one after another.
id_id: Middleware bekerja di antara saluran induk dan saluran slave, mereka terlihat melalui pesan dan status yang dikirimkan di antara saluran, melewatkannya, membuat perubahan atau membuangnya, satu demi satu.
zh_cn: 在消息与状态传递的过程中，中间件位于主端与从端之间，按启用顺序依次对所有消息和状态进行监听、修改或拦截。

source: Like channels, middlewares will also each have an instance per EFB session, managed by the coordinator. However, they don't have centrally polling threads, which means if a middleware wants to have a polling thread or something similar running in the background, it has to stop the thread using Python's ``atexit`` or otherwise.
id_id: Seperti saluran, masing-masing middlewares juga memiliki tingkatan per sesi EFB, yang dikelola oleh koordinator. Akan tetapi, mereka tidak memiliki urutan pemungutan suara terpusat, yang berarti jika middleware ingin memiliki urutan pemungutan atau yang serupa berjalan di latar belakang, ia harus menghentikan urutan menggunakan Python ``Atexit`` atau sebaliknya.
zh_cn: 与信道一样，所有中间件也在 EFB 配置中拥有一个实例，并由协调器进行管理。然而，他们没有集中轮询线程，也就是说如果中间件想要在后台运行轮询线程或类似的线程，这些线程必须通过 Python 的 ``atexit`` 或其他方式停止。

source: Message and Status Processing
id_id: Pemrosesan Pesan dan Status
zh_cn: 消息和状态处理

source: Each middleware by default has 2 methods, :meth:`~.ehforwarderbot.Middleware.process_message` which processes message objects, and :meth:`~.ehforwarderbot.Middleware.process_status` which processes status objects. If they are not overridden, they will not touch on the object and pass it on as is.
zh_cn: 默认情况下，每个中间件都有两个方法：:meth:`~.ehforwarderbot.Middleware.process_message` 处理消息对象，以及 :meth:`~.ehforwarderbot.Middleware.process_status` 处理状态对象。这两个方法默认继承的行为是不对传入的消息或状态进行更改。

source: To modify an object, just override the relative method and make changes to it. To discard an object, simply return ``None``. When an object is discarded, it will not be passed further to other middlewares or channels, which means a middleware or a channel will never receive a ``None`` message or status.
zh_cn: 要修改对象，只需要覆盖相应的方法，并该对象它进行修改。 要拦截一个对象，只需返回 ``None``。对象被拦截后，它不会被传递到其他中间件或信道，也就是说中间件和信道都不应收到 ``None`` 消息或状态。

source: Other Usages
id_id: Penggunaan lainnya
zh_cn: 其他用法

source: Having rather few limitation compare to channels, middlewares are rather easy to write, which allows it to do more than just intercept messages and statuses.
id_id: Mempunyai batasan yang agak sedikit dibandingkan dengan saluran, middlewares lebih mudah untuk ditulis, yang memungkinkannya melakukan lebih dari sekedar mencegat pesan dan status.
zh_cn: 中间件与通道相比限制较少，因此相对容易编写。进而中间件能够做到的不仅仅是截取消息和状态。

source: Some ideas:
id_id: Beberapa gagasan:
zh_cn: 例如：

source: Periodic broadcast to master / slave channels
id_id: Penyiaran berulang-ulang ke saluran utama / slave
zh_cn: 定期向主端、从端群发消息

source: Integration with chat bots
id_id: Penggabungan dengan bot saluran
zh_cn: 集成聊天机器人（chat bot）功能

source: Automated operations on vendor-specific commands / additional features
id_id: Operasi otomatis pada perintah khusus vendor / fitur tambahan
zh_cn: 面向供应商特定指令和附加功能的批量操作

source: Share user session from slave channel with other programs
id_id: Membagikan sesi pengguna dari saluran slave dengan program lainnya
zh_cn: 将从端的用户登录与外部程序共享

source: etc...
id_id: dll...
zh_cn: 等等……

source: Implementation details
zh_cn: 实现细节

source: See :class:`.Middleware`.
zh_cn: 请参阅 \ :class:`.Middleware`\ 。
