Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: tr_tr, zh_cn

source: How to contribute
tr_tr: Nasıl katkıda bulunulur
zh_cn: 如何参与贡献

source: First of all, thanks for taking your time to contribute!
tr_tr: Öncelikle, katkıda bulunmak için zaman harcadığınızdan dolayı teşekkürler!
zh_cn: 首先，感谢您抽出时间对该项目做出贡献！

source: Please note that only questions on the framework will be answered here. For issue related with any channels, please contact their respective authors or post in their corresponding repositories.
zh_cn: 请注意，这里只会回答有关框架的问题。如果您想提有关信道的问题，请联系信道的作者或是在相应的代码仓库中提出疑问。

source: Here is a simple guide on how you can file in an issue, or submit a pull request that is useful and effective.
tr_tr: Aşağıda, bir konuyla nasıl dosya indirebileceğinizle ilgili basit bir kılavuz veya yararlı ve etkili bir çekme isteği gönderin.
zh_cn: 下面是一个简单的指南，介绍如何提交一个简洁明了的问题报告或是功能请求的请求。

source: If you need help, or want to talk to the authors, feel free to chat with us at our `Gitter chat`_ or `Telegram support group`_.
tr_tr: Eğer yardıma ihtiyacınız varsa veya yazarlarla konuşmak istiyorsanız, lütfen bizle `Gitter chat`_ veya `Telegram support group`_ üzerinden sohbet etmekten çekinmeyiniz.
zh_cn: 如果您有任何问题，或是想与作者交流，欢迎加入我们的 \ `Gitter 聊天室`_\ 或是 \ `Telegram 群组`_\ 。

source: Before you ask a question, please read and follow `this guide`_ as far as possible. Without doing so might lead to unfriendly or no response from the community, although we try to refrain from doing so.
zh_cn: 在提出问题之前，请仔细阅读并尽可能的遵循\ 这份指南_\ 。否则可能导致社区不友善的回应或是零回应，虽然我们会尽量避免这样做。

source: Reporting bugs
tr_tr: Arıza bildirme
zh_cn: 反馈 Bug

source: Before submitting a bug report
tr_tr: Arıza raporunu bildirmeden önce
zh_cn: 提交 bug 报告之前

source: Please ensure if your issue is about the framework itself, not about any module. Reports about modules should go to their respective issue trackers.
zh_cn: 请确保您的问题仅限于框架本身，而不针对某个特定的组件。有关组件的问题应前往组件的相关区域提问。

source: Read through the documentation to see if it has covered your question.
tr_tr: Sorunuzu kapsamış olup olmadığını görmek için belgeleri okuyun.
zh_cn: 请先阅读文档，以查看您的问题是否已有解决方案。

source: Check the `current issue list`__ to see if it's been reported.
tr_tr: Bildirinizi görmek için `current issue list`__ 'i kontrol edin.
zh_cn: 检查 \ `已报告的 Issue 列表`__\ 以确保您的问题未被报告过。

source: How Do I Submit A (Good) Bug Report?
tr_tr: Nasıl (İyi) Bir Hata Raporu Gönderirim?
zh_cn: 如何提交一份（有用的）Bug 报告？

source: **Use a clear and descriptive title** for the issue to identify the problem.
tr_tr: Konuyla alakalı probleminizi tanımlarken **net ve betimleyici bir başlık kullanın**.
zh_cn: **使用一个明确的和描述性的标题**\ 来描述问题。

source: **Describe the exact steps which reproduce the problem** in as many details as possible.
tr_tr: Mümkün olduğunca detaylı olarak **probleme sebep olan adımları tarif ediniz**.
zh_cn: 尽可能地给出重现问题的\ **详细确切步骤**\ 。

source: **Provide specific examples to demonstrate the steps.**
tr_tr: **Adımları göstermek için spesifik örnekler temin ediniz.**
zh_cn: **提供具体的示例及复现步骤。**

source: **Describe the behavior you observed after following the steps** and point out what exactly is the problem with that behavior.
tr_tr: **Adımları takip ettikten sonra gözlemlediğiniz davranışı tarif ediniz** ve bu davranışla ilgili problemin ne olduğunu tam olarak ifade ediniz.
zh_cn: **描述你执行这些步骤后所观察到的现象**\ ，并指出这种现象所存在的问题。

source: **Explain which behavior you expected to see instead and why.**
tr_tr: **Bunun yerine nasıl bir davranış görmeyi beklerdiniz ve neden.**
zh_cn: **解释一下你期望发生的现象及为原因。**

source: **If the problem wasn't triggered by a specific action**, describe what you were doing before the problem happened and share more information using the guidelines below.
tr_tr: **eğer problem spesifik bir işlemle tetiklenmemişse**, bu problem olmadan önce ne yaptığınızı betimleyiniz ve alttaki kılavuzu kullanarak daha çok bilgi paylaşın.
zh_cn: **若问题不是由某个特定操作引起的**\ ，请描述问题发生前你所进行的操作，并依据以下准则提交尽可能多的信息。

source: **Provide log related to the issue.** Use the verbose flag to start the logging process, and submit the entire log from the first step you performed.
tr_tr: ** Soruna ilişkin günlüğü sağlayın ** Günlüğe kaydetme işlemini başlatmak için ayrıntılı bayrağı kullanın ve yaptığınız ilk adımdan tüm günlük dosyasını gönderin.
zh_cn: **提供与该问题相关的日志。**\ 使用 verbose 模式启动日志记录过程，并提交从第一步操作开始的完整日志。

source: Provide more context by answering these questions:
tr_tr: Bu sorulara cevap vererek daha fazla içerik sağlayın:
zh_cn: 通过回答这些问题以提供更多的背景信息：

source: **Did the problem start happening recently** (e.g. after updating to the latest version) or was this always a problem?
tr_tr: **Bu problem yakın zamanda mı oluşmaya başladı** (örneğin sürümü en sonuncuya güncelledikten sonra) ya da bu problem her zaman var mıydı?
zh_cn: **是否最近才出现问题**\ （如更新到最新版本后），还是一直存在这个问题？

source: **Can you reliably reproduce the issue?** If not, provide details about how often the problem happens and under which conditions it normally happens.
tr_tr: ** Sorunun güvenilir bir şekilde çoğaltılabilir misiniz? ** Değilse, sorunun ne sıklıkla yaşandığı ve hangi koşullar altında normalde gerçekleştiği hakkında ayrıntılı bilgi verin.
zh_cn: **您能可靠地重现这个问题吗？**\ 如果不能，请提供详细信息，描述问题发生的大致频率和通常在何种情况下它会发生。

source: Include details about your configuration and environment:
tr_tr: Konfigürasyonunuz ve ortamınız hakkında ayrıntı ekleyin:
zh_cn: 提供您的配置信息及操作环境：

source: **What version of EFB are you using?** You can get the version by using the flag ``--version``.
zh_cn: **您的 EFB 版本号是多少？** 您可以通过 \ ``--version``\ 来获取版本号。

source: **What's the name and version of the OS you're using?**
tr_tr: **Kullandığınız OS'nin adı ve sürümü nedir?**
zh_cn: **您的操作系统类型及版本号是多少？**

source: When submitting your log, please remember to hide your private information.
tr_tr: Günlüğünüzü gönderirken lütfen kişisel bilgilerinizi gizlemeyi unutmayın.
zh_cn: 在您提交报告前，请确保您的个人信息已被全部抹去。

source: Suggesting enhancements
tr_tr: Geliştirme önerilerinde bulunma
zh_cn: 功能建议

source: If you have any suggestions, feel free to raise it up in the issue list. Please try to provide as much details as you can, that includes:
tr_tr: Eğer önerileriniz varsa, sorun listesinde belirtmekten çekinmeyin. Lütfen mümkün olduğunca çok detay vermeye çalışın, dahil edin:
zh_cn: 如果您有任何疑问，请在 issue 中提交您的问题。请尽量提供您所掌握的信息，包括：

source: **Use a clear and descriptive title** for the issue to identify the suggestion.
tr_tr: Öneriyi tanımlayan konu için **net ve betimleyici bir başlık kullanın**.
zh_cn: **使用一个明确的和描述性的标题**\ 来描述您的建议。

source: **Give details on how the enhancement behave**.
tr_tr: ** Geliştirmenin nasıl davrandığına ilişkin ayrıntıları ver **.
zh_cn: **详细说明新功能的行为**。

source: **Provide specific examples to demonstrate the abstraction**.
zh_cn: **提供具体的抽象化方式及示例。**

source: The enhancement to the framework must be applicable to considerably many IM platforms, not just for a single IM. Suggestions for a specific IM should be made to their relative channel.
zh_cn: 对框架提出的提案必须适用于多数即时通讯平台，而不只是一个单一的平台。 针对某一平台的具体建议应在其相关信道提出。

source: Adapted from `Atom contribution guide`__ by GitHub Inc.
tr_tr: GitHub Inc. tarafından `Atom katkı rehberi`__ 'dan uyarlanmıştır.
zh_cn: 改编自 GitHub Inc 的 \ `Atom contribution guide`__\ 。

source: When you have done some changes and want to submit it to us, fork it to your account and submit a GitHub pull request. Please write a detailed description for your pull request on:
tr_tr: Bazı değişiklikler yaptıysanız ve bize göndermek istiyorsanız, hesabınıza gönderin ve bir GitHub çekme isteği gönderin. Çekme isteğiniz için lütfen ayrıntılı bir açıklama yazın:
zh_cn: 当您对程序做了些修改并想要提交给我们，请将该项目 fork 至您的账户并修改，并提交一份 pull request。请在您的 pull request 中详细描述以下内容：

source: **What changes have you made?**
tr_tr: **Ne değişiklikler yaptınız?**
zh_cn: **您做了什么更改？**

source: **What problem have you solved?**
tr_tr: **Hangi problemleri çözdünüz?**
zh_cn: **您解决了哪一个问题？**

source: **Which issue have you addressed** if applicable.
tr_tr: ** Uygulanabilir ise ** hangi konuyu konuştunuz **.
zh_cn: **您涉及了哪一个 issue？**\ （若适用）。

source: Always write a clear log message for your commits. One-line messages are fine for small changes, but bigger changes needs a detailed description after the one-liner.
tr_tr: İşlemleriniz için daima net bir günlük mesajı yazın. Tek satırlı mesajlar küçük değişiklikler için uygundur, ancak daha büyük değişikliklerin tek satırdan sonra ayrıntılı bir açıklamaya ihtiyacı vardır.
zh_cn: 为所有 commit 撰写清楚的日志消息。对于简单的修改，可以接受简短的说明，但达到一定程度更改需要在正文进行详细的描述。

source: Adapted from `OpenGovernment contribution guide`__ by Participatory Politics Foundation
tr_tr: Katılımcı Siyaset Vakfı tarafından hazırlanan `OpenGovernment contribution guide`__ dan uyarlanmıştır.
zh_cn: 改编自 Participatory Politics Foundation 的 \ `OpenGovernment contribution guide`__\ 。

source: Pull requests
tr_tr: Çekme istekleri
