Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/start.po
Languages: tr_tr

source: Launch the framework
tr_tr: Framework'ü başlat

source: EH Forwarder Bot offered 2 ways to launch the framework:
tr_tr: EH Forwarder Bot, sistemi başlatmak için 2 yol önerdi:

source: Both commands are exactly the same thing, accept the same flags, run the same code. The latter is only a backup in case the former does not work.
tr_tr: Her iki komut da tam olarak aynı şeydir, aynı bayrakları kabul eder, aynı kodu çalıştırır. İkincisi yalnızca ilkinin çalışmaması durumu için bir yedektir.

source: Options
tr_tr: Seçenekler

source: ``-h``, ``--help``: Show help message
tr_tr: ``-h``, ``--help``: Yardım mesajını göster

source: From version 2, EFB supports running different instances under the same user, identified by their profiles. The default profile is named ``default``.
tr_tr: Sürüm 2'de EFB, profilleri tarafından tanımlanan aynı kullanıcı altındaki farklı örnekleri çalıştırmayı desteklemektedir. Varsayılan profile ``default`` adı verilir.

source: ``-V``, ``--version``: Print version information
tr_tr: ``-V``, ``--version``: Sürüm bilgilerini yazdır

source: This shows version number of Python you are using, the EFB framework, and all channels and middlewares enabled.
tr_tr: Bu, kullandığınız Python'un sürüm numarasını, EFB yapısını, tüm kanalları ve özel yazılımları etkinleştirildiğini gösterir.

source: ``-v``, ``--verbose``: Print verbose log
tr_tr: ``-v``, ``--verbose``: Ayrıntılı günlüğü yazdır

source: This option enables verbose log of EFB and all enabled modules. This, together with ``-V``, is particularly useful in debugging and issue reporting.
tr_tr: Bu seçenek, EFB'nin ve tüm etkin modüllerin ayrıntılı günlüğünü etkinleştirir. Bu ``-V`` ile birlikte, özellikle hata ayıklama ve sorun raporlamada kullanışlıdır.
