Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/channel.po
Languages: es_ve

source: The abstract channel class.
es_ve: La clase abstracta del canal.

source: Initialize the channel. Inherited initializer must call the "super init" method at the beginning.
es_ve: Inicializa el canal. El inicializador heredado debe llamar al método "super init" al principio.

source: Parameters
es_ve: Parámetros

source: Instance ID of the channel.
es_ve: ID de la instancia del canal.

source: Get the chat object from a slave channel.
es_ve: Obtén el objeto chat de un canal esclavo.

source: UID of the chat.
es_ve: UID del chat.

source: UID of group member, only when the selected chat is a group.
es_ve: UID del miembro del grupo, solo aplica cuando el chat seleccionado es un grupo.

source: Returns
es_ve: Resultados

source: The chat found.
es_ve: El chat fue encontrado.

source: Return type
es_ve: Tipo de dato devuelto

source: This is not required by Master Channels
es_ve: Esto no es requerido por los canales maestros

source: Get the profile picture of a chat. Profile picture is also referred as profile photo, avatar, "head image" sometimes.
es_ve: Obtén la imágen de perfil del chat. La imagén de perfil algunas veces es conocida también como la foto de perfil, avatar o "imágen principal".

source: Chat to get picture from.
es_ve: El chat del que se obtendrá la imágen.

source: Opened temporary file object. The file object must have appropriate extension name that matches to the format of picture sent, and seek to position 0. It can be deleted when closed if not required otherwise.
es_ve: Abierto el archivo temporal del objeto. El archivo objeto debe tener un nombre de extensión apropiada el cual coincida con el formato de la imágen enviada, y busque colocarse en la posición 0. Puede ser eliminado al cerrarse si no es requerido nuevamente.

source: Opened temporary file object. The file object must have appropriate extension name that matches to the format of picture sent, and seek to position 0.
es_ve: Abierto el archivo temporal del objeto. El archivo objeto debe tener un nombre de extensión apropiada el cual coincida con el formato de la imágen enviada, y busque colocarse en la posición 0.

source: It can be deleted when closed if not required otherwise.
es_ve: Puede ser eliminado al cerrarse si no es requerido nuevamente.

source: Examples
es_ve: Ejemplos

source: Return a list of available chats in the channel.
es_ve: Devuelve una lista de chat disponibles en el canal.

source: a list of available chats in the channel.
es_ve: una lista de chat disponibles en el canal.

source: Get a list of additional features
es_ve: Obtén una lista de funciones adicionales

source: A dict of methods marked as additional features. Method can be called with ``get_extra_functions()["methodName"]()``.
es_ve: Un diccionario de métodos marcados como funciones adicionales. El método debe ser llamado con ``get_extra_functions()["methodName"]()``.

source: Method to poll for messages. This method is called when the framework is initialized. This method should be blocking.
es_ve: Método para el monitoreo de los mensajes (polling). Este método es llamado cuando el framework es inicializado. Este método debe ser bloqueante.

source: Send a message to, or edit a sent message in the channel.
es_ve: Envía un mensaje a, o edita un mensaje que fue enviado al canal.

source: Message object to be processed.
es_ve: Objeto mensaje a ser procesado.

source: The same message object with message ID from the recipient.
es_ve: El objeto mensaje con el mismo ID de mensaje que el destinatario.

source: Send a status to the channel.
es_ve: Envía un estado al canal.

source: the status
es_ve: el estado

source: This is not applicable to Slave Channels
es_ve: Esto no es aplicable a los canales esclavos

source: When EFB framework is asked to stop gracefully, this method is called to each channel object to stop all processes in the channel, save all status if necessary, and terminate polling.
es_ve: Cuando se le solicita al framework EFB detenerse, este método es llamado en todos los objetos canales para detener todos los procesos en sus respectivos canales, salvar todo los estados de ser necesario, y terminar el monitoreo.

source: When the channel is ready to stop, the polling function must stop blocking. EFB framework will quit completely when all polling threads end.
es_ve: Cuando el canal esta listo para detenerse, la función de sondeo (polling) debe parar el bloqueo. El framework EFB se detendrá completamente cuando todos los hilos de sondeo se detengan.

source: Common operations
es_ve: Operaciones comunes

source: Sending messages and statuses
es_ve: Enviando mensajes y estados

source: Sending messages and statuses to other channels is the most common operation of a channel. When the channel has gathered enough information from external sources, it should be further processed and packed into the relative objects, i.e. :obj:`.EFBMsg` and :obj:`.EFBStatus`.
es_ve: Enviar mensajes y estados a otros canales es la operación más común del canal. Cuando el canal ha recolectado suficiente información de fuentes externas, debe ser procesado y empaquetado dentro de sus objetos respectivos, i.e. :obj:`.EFBMsg` and :obj:`.EFBStatus`.

source: When the related information is packed into their relative objects, it can be sent to the coordinator for the next step.
es_ve: Cuando la información es empaquetada en sus respectivos objetos, puede ser enviada al coordinador para el siguiente paso.

source: For now, both :obj:`.EFBMsg` and :obj:`.EFBStatus` has an attribute that indicates that where this object should be delivered to (:attr:`.EFBMsg.deliver_to` and :attr:`.EFBStatus.destination_channel`). This is used by the coordinator when delivering the message.
es_ve: Por ahora, los objetos :obj:`.EFBMsg` and :obj:`.EFBStatus` tienen un atributo que indica donde debe ser entregado este objeto (:attr:`.EFBMsg.deliver_to` y :attr:`.EFBStatus.destination_channel`). Estos son usados por el coordinador cuando esta enviando el mensaje.

source: For messages, it can be delivered with :meth:`.coordinator.send_message`, and statuses can be delivered with :meth:`.coordinator.send_status`.
es_ve: Para mensajes, pueden ser enviados con :meth:`.coordinator.send_message`, y los estados pueden ser enviados con :meth:`.coordinator.send_status`.

source: When the object is passed onto the coordinator, it will be further processed by the middleware.
es_ve: Cuando un objeto es enviado al coordinador, luego será procesado por el middleware.

source: About Channel ID
es_ve: Acerca del ID del canal

source: With the introduction of instance IDs, it is required to use the ``self.channel_id`` or equivalent instead of any hard-coded ID or constants while referring to the channel (e.g. while retrieving the path to the configuration files, creating chat and message objects, etc).
es_ve: Con la introducción de los ID de las instancias, es necesario utilizar ``self.channel_id`` o un equivalente en vez de escribir manualmente el código del ID o utilizar constantes al momento de referirnos al canal ( Ejemplo: al obtener la ruta del archivo de configuración, al crear objetos de mensajes o chats, etc).
