Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/chat.po
Languages: az_az

source: EFBChat
az_az: EFBÇat

source: EFB Chat object. This is used to represent a chat or a group member.
az_az: EFB Çat obyekti. Bu, çat və ya qrup istifadəçilərini təmsil etmək üçün istifadə olunur.

source: *str* -- Unique ID of the channel.
az_az: *str* -- Kanalın unikal İD-i.

source: *str* -- Emoji of the channel.
az_az: *str* -- Kanalın emojisi.

source: *str* -- Name of the channel.
az_az: *str* -- Kanalın adı.

source: *str* -- Name of the chat.
az_az: *str* -- Çatın adı.

source: *str* -- Alternative name of the chat, usually set by user.
az_az: *str* -- Çatın alternativ adı, adətən istifadəçi tərəfindən təyin olunur.

source: :obj:`.ChatType` -- Type of the chat.
az_az: :obj:`.ChatType` -- Çatın növü.

source: *str* -- Unique ID of the chat. This should be unique within the channel.
az_az: *str* -- Çatın unikal İD-i. Kanalda bu unikal olmalıdır.

source: *bool* -- Indicate if this object represents a chat. Defaulted to ``True``. This should be set to ``False`` when used on a group member.
az_az: *bool* -- Bu obyektin bir çatıi təmsil etdiyini göstərir. Defolt olaraq ``True``. Bir qrup üzvü istifadə edərkən bu ``False``olaraq təyin olunmalıdır.

source: :obj:`.EFBChat` or None -- The parent chat of the member. Only available to chat member objects. Defaulted to ``None``.
az_az: :obj:`.EFBChat` və ya Heç nə -- Üzvün ana söhbəti. Sadəcə çat obyekt üzvlərinə mümkündür. Defolt olaraq ``None``.

source: list of :obj:`.EFBChat` -- Provide a list of members in the group. Defaulted to an empty ``list``. You may want to extend this object and implement a ``@property`` method set for loading members on demand.
az_az: list of :obj:`.EFBChat` -- Qrupdakı üzvlərin siyahısını təmin edir. Defolt olaraq boşdur``list``. Bu obyekti genişləndirmək və tətbiq etmək olar ``@property``üsul üzvlərin yüklənməsini təmin edir.

source: *Dict[str, Any]* -- Any vendor specific attributes.
az_az: *Dict[str, Any]* -- Hər hansı satıcı üçün xüsusi atributlar.

source: *bool* -- Indicate if this chat represents the user.
az_az: *bool* -- Bu çatın istifadəçisi olduğunu göstərir.

source: *bool* -- Indicate if this chat represents a system chat/member.
az_az: *bool* -- Bu çatın bir sistem çatı / üzvü olduğunu göstərir.

source: Parameters
az_az: Tənzimləmələr

source: Provide the channel object to fill :attr:`channel_name`, :attr:`channel_emoji`, and :attr:`channel_id` automatically.
az_az: Kanal obyektini doldurmaq üçün təmin edilir :attr:`channel_name`, :attr:`channel_emoji`, və :attr:`channel_id`avtomatik olaraq.

source: If this chat represents the user
az_az: Bu söhbət istifadəçini təmsil edir

source: If this chat is a system chat
az_az: Bu çat bir sistem çatıdır

source: Set the chat as yourself. In this context, "yourself" means the user behind the master channel. Every channel should relate this to the corresponding target.
az_az: Çatınızı özünüz kimi təyin edin. Bu kontekstdə "özünüz" usta kanalın arxasında olan istifadəçi deməkdir. Hər bir kanal bunu müvafiq hədəf olaraq əlaqələndirməlidir.

source: Returns
az_az: Qaytarmalar

source: This object.
az_az: Bu obyekt.

source: Return type
az_az: Qaytarma növü

source: Set the chat as a system chat. Only set for channel-level and group-level system chats.
az_az: Çatı sistem çatı olaraq təyin et. Sadəcə səviyyəli kanal və səviyyəli qrup sistem çatları olaraq təyin oluna bilər.

source: Verify the completeness of the data.
az_az: Məlumatların tamlığını yoxla.

source: raises
az_az: yüksəldir

source: :exc:`ValueError` -- When this chat is invalid.
az_az: :exc:`ValueError` -- Bu zaman çat etibarsızdır.
