Repository: wolfsilver/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/coordinator.po
Languages: az_az, zh_cn

source: Coordinator
az_az: Koordinator
zh_cn: 协调器

source: Coordinator among channels.
az_az: Koordinator içərisindəki kanallar.
zh_cn: 通道间的协调器。

source: Name of current profile..
zh_cn: 当前配置档案的名称

source: type
zh_cn: 类型

source: Global interaction thread lock.
zh_cn: 全局交互线程锁。

source: The running master channel object.
zh_cn: 正在运行的主端对象。

source: Dictionary of running slave channel object. Keys are the unique identifier of the channel.
zh_cn: 正在运行的从端的字典。键值为信道的唯一标识符。

source: List of middlewares
zh_cn: 中间件列表

source: Register the channel with the coordinator.
az_az: Kanalı koordinator olaraq qeydiyyatan keçirt.
zh_cn: 向协调器注册信道。

source: Parameters
az_az: Tənzimləmələr
zh_cn: 参数

source: Channel to register
az_az: Kanalı qeydiyyatdan keçirt
zh_cn: 需注册的信道

source: Register a middleware with the coordinator.
az_az: Koordinatorla birlikdə orta səviyyəli proqramı qeyd edin.
zh_cn: 向协调器注册一个中间件。

source: Middleware to register
az_az: Orta sinifi qeydiyyat et
zh_cn: 需要注册的中间件

source: Return the module instance of a provided module ID
zh_cn: 返回该组件 ID 对应的实例。

source: Module ID, with instance ID if available.
zh_cn: 组件 ID，包含实例 ID（若有）。

source: Returns
az_az: Qaytarmalar
zh_cn: 返回

source: Module instance requested.
zh_cn: 请求的组件实例。

source: Raises
zh_cn: 抛出

source: When the module is not found.
zh_cn: 当组件无法找到时。

source: The thread running poll() of the master channel.
zh_cn: 运行主端 poll() 函数的线程。

source: Instances of middlewares. Sorted in the order of execution.
zh_cn: 中间件实例，按执行顺序排序

source: Mutual exclusive lock for user interaction through CLI interface
zh_cn: CLI 界面中用户交互的独占锁

source: Current running profile name
zh_cn: 当前配置档案的名称

source: Deliver a message to the destination channel.
az_az: Təyinat olunan kanala mesajı çatdır.
zh_cn: 向目标信道传送一个消息。

source: The message
az_az: Mesaj
zh_cn: 消息

source: The message sent by the destination channel, includes the updated message ID from there. Returns ``None`` if the message is not sent.
az_az: Bu mesaj təyinat kanalına göndərildi, bura yenilənmiş mesaj İD-i də daxil edilib. Qaytarmalar ``None`` mesaj göndərilməmişdir.
zh_cn: 由目标信道发送的消息，包括来自目标信道的新的消息 ID。如果消息没有被发送则返回 ``None``。

source: The status
az_az: Status
zh_cn: 状态

source: Threads running poll() from slave channels. Keys are the channel IDs.
zh_cn: 运行从端 poll() 函数的线程。键值为信道 ID。

source: Instances of slave channels. Keys are the channel IDs.
zh_cn: 从端实例，键值为信道 ID。

source: Internal GNU gettext translator.
zh_cn: 内部 GNU gettext 翻译器。

source: *str* -- Name of current profile..
az_az: *str* -- Hazırki profilin adı..

source: *threading.Lock* -- Global interaction thread lock.
az_az: *threading.Lock* -- Qlobal qarşılıqlı mövzu kilidi.

source: *EFBChannel* -- The running master channel object.
az_az: *EFBChannel* -- Usta kanal obyekti işləyir.

source: *Dict[str, EFBChannel]* -- Dictionary of running slave channel object. Keys are the unique identifier of the channel.
az_az: *Dict[str, EFBChannel]* --Ana kanal obyektinin işlədiyi kataloq. Açarlar kanalın unikal identifikatorudur.

source: *List[EFBMiddleware]* -- List of middlewares
az_az: *List[EFBMiddleware]* -- Orta siniflərin siyahısı
